app/controllers/images/property_images_controller.rb

SELECT * FROM `images` WHERE (`images`.imageable_id = 1 AND `images`.imageable_type = 'Property') AND ( (`images`.`type` = 'PropertyImage' ) ) ORDER BY position ASC
---
  def thumb
    @property_image = PropertyImage.find(params[:id])

SELECT * FROM `images` WHERE (`images`.imageable_id = 1 AND `images`.imageable_type = 'Property') AND ( (`images`.`type` = 'PropertyImage' ) ) ORDER BY position ASC
---
  def mini_glider
    @property_image = PropertyImage.find(params[:id])