app/controllers/listings_controller.rb

  def index
    # Record user's search results for the most recent listings index they
    # have viewed
    session[:last_seen_params] = search_params

    # Searchlogic filtering
    # TODO: figure out how to avoid using named scope hack
#    if order_field
#      case order_direction
#      when 'DESC'
#        direction = 'descend_by'
#      else
#        direction = 'ascend_by'
#      end
#    end
    unless active_agency.master_agency
      @search = active_agency.listing.search( search_params )
---
SELECT * FROM `agencies` ORDER BY agencies.domain = 'localhost' DESC, agencies.subdomain IS NULL DESC, agencies.master_agency = 1 DESC, agencies.id ASC LIMIT 1
SELECT `listings`.* FROM `listings` INNER JOIN `properties` ON `properties`.id = `listings`.property_id INNER JOIN `barrios` ON `barrios`.id = `properties`.barrio_id INNER JOIN `countries` ON `countries`.id = `barrios`.country_id INNER JOIN `listing_types` ON `listing_types`.id = `listings`.listing_type_id INNER JOIN `properties` properties_listings ON `properties_listings`.id = `listings`.property_id INNER JOIN `barrios` barrios_properties ON `barrios_properties`.id = `properties_listings`.barrio_id INNER JOIN `markets` ON `markets`.id = `barrios_properties`.market_id INNER JOIN `category_assignments` ON (`listings`.`id` = `category_assignments`.`category_assignable_id` AND `category_assignments`.`category_assignable_type` = 'Listing') INNER JOIN `categories` ON (`categories`.`id` = `category_assignments`.`category_id`) WHERE (((((countries.name = 'Costa Rica') AND (listing_types.name = 'for sale')) AND (markets.name = 'Heredia')) AND (categories.name = 'Homes')) AND (properties.agency_id = 1)) ORDER BY markets.country_id ASC, markets.name ASC